notes/Getting Started with Orgzly.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 15:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd08fdc4">1. Notes</a>
<ul>
<li><a href="#orga0f516f">1.1. Click on a plus icon to create a new note</a></li>
<li><a href="#org43adf5e">1.2. Note has a title</a></li>
<li><a href="#org92fa3ef">1.3. Click and hold the note to select it</a>
<ul>
<li><a href="#orgf0d1945">1.3.1. You can create a sub-note</a>
<ul>
<li><a href="#orge25ea81">1.3.1.1. You can have as many levels as you like</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4544a4e">1.4. Note can have tags&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tutorial">tutorial</span>&#xa0;<span class="help">help</span>&#xa0;<span class="tags">tags</span></span></a></li>
<li><a href="#orga55ccb4">1.5. Note can have a priority</a></li>
<li><a href="#org7121b71">1.6. <span class="todo TODO">TODO</span> Task is a note prefixed with TODO</a></li>
<li><a href="#org63c4650">1.7. <span class="done DONE">DONE</span> Task can be completed by setting its state to DONE</a></li>
<li><a href="#org5757dad">1.8. <span class="todo TODO">TODO</span> You can set scheduled time</a></li>
<li><a href="#orgc8a9083">1.9. <span class="todo TODO">TODO</span> You can set deadline time</a></li>
<li><a href="#org4d03b35">1.10. You can fling note right to open its quick-menu</a></li>
</ul>
</li>
<li><a href="#orgf0f3e64">2. Searching</a>
<ul>
<li><a href="#org28bdf96">2.1. You can search notes by clicking the search icon</a></li>
<li><a href="#org025b55e">2.2. You can search for text occurring anywhere in the note</a></li>
<li><a href="#org6e5ccf0">2.3. You can use search operators to narrow down the results</a></li>
<li><a href="#orgc7fd015">2.4. If you are searching from a notebook, default search operator will be added for you</a></li>
<li><a href="#orgfb2f71c">2.5. There are two saved searches in navigation drawer</a></li>
</ul>
</li>
<li><a href="#orgae17578">3. Settings</a>
<ul>
<li><a href="#orgf70d780">3.1. Go through available settings</a></li>
</ul>
</li>
<li><a href="#orgedeaa40">4. Syncing</a>
<ul>
<li><a href="#org71e7dd4">4.1. Add a repository from Settings</a></li>
<li><a href="#org9772e0e">4.2. Start sync</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Welcome to Orgzly. Check some of the features by going through these notes.
</p>

<div id="outline-container-orgd08fdc4" class="outline-2">
<h2 id="orgd08fdc4"><span class="section-number-2">1</span> Notes</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orga0f516f" class="outline-3">
<h3 id="orga0f516f"><span class="section-number-3">1.1</span> Click on a plus icon to create a new note</h3>
</div>
<div id="outline-container-org43adf5e" class="outline-3">
<h3 id="org43adf5e"><span class="section-number-3">1.2</span> Note has a title</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Note can also have a body.
</p>
</div>
</div>

<div id="outline-container-org92fa3ef" class="outline-3">
<h3 id="org92fa3ef"><span class="section-number-3">1.3</span> Click and hold the note to select it</h3>
<div class="outline-text-3" id="text-1-3">
<p>
You can select multiple notes and edit them.
</p>
</div>

<div id="outline-container-orgf0d1945" class="outline-4">
<h4 id="orgf0d1945"><span class="section-number-4">1.3.1</span> You can create a sub-note</h4>
<div class="outline-text-4" id="text-1-3-1">
</div><div id="outline-container-orge25ea81" class="outline-5">
<h5 id="orge25ea81"><span class="section-number-5">1.3.1.1</span> You can have as many levels as you like</h5>
<div class="outline-text-5" id="text-1-3-1-1">
<p>
Collapsing (folding) notes will be supported soon.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org4544a4e" class="outline-3">
<h3 id="org4544a4e"><span class="section-number-3">1.4</span> Note can have tags&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tutorial">tutorial</span>&#xa0;<span class="help">help</span>&#xa0;<span class="tags">tags</span></span></h3>
</div>
<div id="outline-container-orga55ccb4" class="outline-3">
<h3 id="orga55ccb4"><span class="section-number-3">1.5</span> Note can have a priority</h3>
</div>
<div id="outline-container-org7121b71" class="outline-3">
<h3 id="org7121b71"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> Task is a note prefixed with TODO</h3>
<div class="outline-text-3" id="text-1-6">
<p>
TODO is a state. You can have any number of different states (type of notes). You can add new states in Settings.
</p>
</div>
</div>

<div id="outline-container-org63c4650" class="outline-3">
<h3 id="org63c4650"><span class="section-number-3">1.7</span> <span class="done DONE">DONE</span> Task can be completed by setting its state to DONE</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Time is automatically added.
</p>
</div>
</div>

<div id="outline-container-org5757dad" class="outline-3">
<h3 id="org5757dad"><span class="section-number-3">1.8</span> <span class="todo TODO">TODO</span> You can set scheduled time</h3>
<div class="outline-text-3" id="text-1-8">
</div>
</div>

<div id="outline-container-orgc8a9083" class="outline-3">
<h3 id="orgc8a9083"><span class="section-number-3">1.9</span> <span class="todo TODO">TODO</span> You can set deadline time</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Both scheduled and deadline times can be used.
</p>
</div>
</div>

<div id="outline-container-org4d03b35" class="outline-3">
<h3 id="org4d03b35"><span class="section-number-3">1.10</span> You can fling note right to open its quick-menu</h3>
<div class="outline-text-3" id="text-1-10">
<p>
You can fling note left to open a different menu.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf0f3e64" class="outline-2">
<h2 id="orgf0f3e64"><span class="section-number-2">2</span> Searching</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org28bdf96" class="outline-3">
<h3 id="org28bdf96"><span class="section-number-3">2.1</span> You can search notes by clicking the search icon</h3>
</div>
<div id="outline-container-org025b55e" class="outline-3">
<h3 id="org025b55e"><span class="section-number-3">2.2</span> You can search for text occurring anywhere in the note</h3>
</div>
<div id="outline-container-org6e5ccf0" class="outline-3">
<h3 id="org6e5ccf0"><span class="section-number-3">2.3</span> You can use search operators to narrow down the results</h3>
<div class="outline-text-3" id="text-2-3">
<p>
b.Notebook – notes from notebook “Notebook”
i.todo – notes with “TODO” state
.i.done – notes which do not have “DONE” state
s.today – notes scheduled for today or earlier
t.help – notes with a tag “help”
p.a – notes with a priority “A”
</p>
</div>
</div>

<div id="outline-container-orgc7fd015" class="outline-3">
<h3 id="orgc7fd015"><span class="section-number-3">2.4</span> If you are searching from a notebook, default search operator will be added for you</h3>
</div>
<div id="outline-container-orgfb2f71c" class="outline-3">
<h3 id="orgfb2f71c"><span class="section-number-3">2.5</span> There are two saved searches in navigation drawer</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Try them and notice the operators used.
</p>
</div>
</div>
</div>

<div id="outline-container-orgae17578" class="outline-2">
<h2 id="orgae17578"><span class="section-number-2">3</span> Settings</h2>
<div class="outline-text-2" id="text-3">
<p>
Settings button is located in the menu or in the top right corner, if your device doesn't have a menu button.
</p>
</div>

<div id="outline-container-orgf70d780" class="outline-3">
<h3 id="orgf70d780"><span class="section-number-3">3.1</span> Go through available settings</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Modify them to your liking to improve your experience with Orgzly.
</p>
</div>
</div>
</div>

<div id="outline-container-orgedeaa40" class="outline-2">
<h2 id="orgedeaa40"><span class="section-number-2">4</span> Syncing</h2>
<div class="outline-text-2" id="text-4">
<p>
Notebooks can be saved to your Dropbox or a directory on your device. Plain-text files in Org mode format are used.
</p>
</div>

<div id="outline-container-org71e7dd4" class="outline-3">
<h3 id="org71e7dd4"><span class="section-number-3">4.1</span> Add a repository from Settings</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Repository is a directory inside Dropbox or on your device. Soon, additional repository types will be supported such as Git, Google Drive, SSH and more.
</p>
</div>
</div>

<div id="outline-container-org9772e0e" class="outline-3">
<h3 id="org9772e0e"><span class="section-number-3">4.2</span> Start sync</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Syncing is currently manual. Button is located in the navigation drawer.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
